[Killed] BlockStatement
src/operacoes.js:48:32
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
 function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
 function diminuirPorcentagem(valor, percentual) { return valor * (1 - percentual / 100); }
-function inverterSinal(numero) {
-  return numero === 0 ? 0 : -numero;
-}
+function inverterSinal(numero) {}
 
 // === Bloco 3: Funções Trigonométricas e Logarítmicas (21-30) ===
killedBy: Suíte de Testes Completa para 50 Operações Aritméticas 20. inverterSinal deve inverter sinal de número positivo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -42
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:49:10
 function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
 function diminuirPorcentagem(valor, percentual) { return valor * (1 - percentual / 100); }
 function inverterSinal(numero) {
-  return numero === 0 ? 0 : -numero;
+  return false ? 0 : -numero;
 }
 
killedBy: Suíte de Testes Completa para 50 Operações Aritméticas 20. inverterSinal deve retornar zero para zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -0

[Killed] EqualityOperator
src/operacoes.js:49:10
 function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
 function diminuirPorcentagem(valor, percentual) { return valor * (1 - percentual / 100); }
 function inverterSinal(numero) {
-  return numero === 0 ? 0 : -numero;
+  return numero !== 0 ? 0 : -numero;
 }
 
killedBy: Suíte de Testes Completa para 50 Operações Aritméticas 20. inverterSinal deve inverter sinal de número positivo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -42
Received: 0
